/* “稀疏矩阵（Sparse Matrices）”是二维数组的一种非常特殊的情况，因为数组内容的大部分空间都没有使用。数组的元素稀稀落落，故称之为稀疏矩阵。为了增加数组内存的使用效率，我们可以使用一种压缩的方式存放稀疏矩阵的内容。
 */

#include <stdio.h>

int main()
{
	int sparse[5][10] = {  //稀疏矩阵的定义
						0,0,1,0,0,0,0,0,0,0,
						0,0,0,9,0,0,0,0,0,0,
						0,0,0,0,0,2,0,0,0,0,
						0,0,0,0,3,0,0,0,0,0,
						0,0,0,0,0,0,0,6,0,0,
						};
	
	int compress[6][3];  // 压缩数组的声明
	int i,j,k;

	k = 1;   			 //设置变量初值
	compress[0][0] = 5;  //数组sparse有5行
	compress[0][1] = 10; //数组sparse有10行
	compress[0][2] = 5;  //数组使用5个元素

	for(i = 0; i < 5; i++)   //二维数组的遍历
		for(j = 0; j < 10; j++)
			if(sparse[i][j] != 0) //元素有没有使用
			{
				compress[k][0] = i; //存储行数
				compress[k][1] = j; //存储列数
				/* 存储元素值 */
				compress[k][2] = sparse[i][j];
				k++;            //下一行
			}
	
	for(i = 0; i < 6; i++)  //压缩数组的输出
	{
		for(j = 0; j < 3; j++)
			printf("%2d",compress[i][j]);
		printf("\n");       //换行

	}
	return 0;
}

