/* 邻接矩阵表示法（Adjacency Matrix）:
 * 如果现在有一个包含n个顶点的图，我们可以声明一个大小是n*n的二维数组来表示它
 * 其中索引代表顶点，数组内容代表顶点间的边。
 * 一个包含5个顶点的无方向图，我们可以使用一个大小5*5的数组来表示它。
 * 边的填入方法是如果顶点V1和V2邻接，则数组元素（V1，V2）和（V2，V1）的值是1。
 *   1 2 3 4 5
 * 1 0 1 1 0 0
 * 2 1 0 1 1 0
 * 3 1 1 0 0 1
 * 4 0 1 0 0 1
 * 5 0 0 1 1 0
 * 数组内容显示对角线右上和左下三角形对称，这是因为图属于无向图。如果是有向图就不一定对称，因为
 * 路径V1到V2存在并无法保证路径V2到V1也一定存在
 */

#include <stdio.h>
#include <stdlib.h>

int matrix[6][6];     //图的邻接矩阵

/* 创建图 */
void creategraph(int *node,int num)
{
	int from;       //边的起点
	int to;         //边的终点
	int i; 

	for(i = 0; i < num; i++)
	{
		from = node[i*2];    //边的起点
		to = node[i*2 + 1];  //边的终点
		matrix[from][to] = 1;  //存入图
	}
}

/* 主程序：创建图后，将邻接矩阵输出 */
int main()
{
	int node[12][2] = {
					{1,2},{2,1},   //边数组
					{1,3},{3,1},
					{2,3},{3,2},
					{2,4},{4,2},
					{3,5},{5,3},
					{4,5},{5,4}
	};

	int i,j;

	for(i = 1; i <= 5; i++)
		for(j = 1; j <= 5; j++)
			matrix[i][j] = 0;   //清除图邻接矩阵
	creategraph(node,12);  //创建图
	printf("图的邻接矩阵内容：\n");

	for(i = 1; i <= 5; i++)
	{
		for(j = 1; j <= 5; j++)
			printf("%d",matrix[i][j]);   //输出数组内容
		printf("\n");
	}
	return 0;
}


